//---------------------------------------------------
//                      Integer
//---------------------------------------------------
// ۸ بیت	
// i8	Signed
// u8   Unsigned
// ------------------
// ۱۶ بیت	
// i16	Signed
// u16  Unsigned
// ------------------
// ۳۲ بیت	
// i32	Signed
// u32  Unsigned
//  ------------------
// ۶۴ بیت	
// i64  Signed
// u64  Unsigned
//  ------------------
// وابسته به معماری سیستم	
// Isize	Signed
// usize    Unsigned


// let  a : u64 = 1024; // Unsigned
// let  b : i8 = -7;    // Signed
// let  c : usize = 800;  // اگر معماری ۳۲ بیتی باشد، اندازه‌ی عدد هم ۳۲ بیت خواهد بود.
// let  d = -64;          // به صورت پیش•فرض نوع این متغیّر برابر با i32 در نظر گرفته می•شود



// // می‌توانید اعداد را در مبنای ۱۰، ۸، ۱۶ و ۲ نمایش دهید.
// let a = 123_456;    //افزایش خوانایی می‌توانید بین ارقام علامت _ را قرار دهید.
// let b = 0xf2;       //  hexadecimal
// let c = 0o71;       // octal
// let d = 0b1110_0001;    // binary
// let c = b'C';      // byte


//---------------------------------------------------
//                      floating
//---------------------------------------------------


// just 2 type
// f32 
// f64

// let b: f32 = 2.95;   
// ​let a = 2.95;   // به صورت پیش•فرض نوع متغیّر برابر با f64 درتظر گرفته می•شود




//---------------------------------------------------
//                      operator
//---------------------------------------------------

// ذدو طرف عملگر باید هر دو صحیح یا هردو اعشاری باشند

// Wrong
// let a : u64= 5.3;
// let c : i32= 2.5;
// let d = a - c;

// Wrong
// let a = 5;
// let c = 2.5;
// let d = a - c;

// Wrong
// let a : u64= 5.3;
// let c : u32= 2.5;
// let d = a - c;

// Correct
// let a = 5.3;
// let c = 2.5;
// let d = a - c;

// fn main() {
//     let a = 5.3;
//     let c = 2.5;
//     let d = a - c;
//     println!("{}\n", d);
// }

//---------------------------------------------------
//                      Boolean
//---------------------------------------------------
// let a: bool;    // اینجا متغیّر فقط تعریف شده است. ولی مقدار دهی نشده است.
// let b = false;  // اینجا متغیّر هم تعریف شده است و هم مقدار دهی.
// a = true;   // اینجا متغیّر مقدار دهی شده است

//---------------------------------------------------
//                      alphabet
//---------------------------------------------------
// "" for string
// '' for char

fn main(){
    let a = 'e';
    let x = "Iran";
    let b = '1';
    let c = '‌';    //  نیم‌فاصله
    let d = 'پ';
    let e = '👀';
    println!("{} {} {} {} {} {} {}", a,x, b, d, c, d, e);   // فقط برای نمایش در ترمینال
}